claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
       }
     line_lcd=0;
     printf("\nSetClock");
      Set_Clock();
       // reset program point

    }


       //Read Status register from eepom and update it
      //size=sizeof(status);
     //u16 status
     *(u16*)(&status)=(u16)(FLASH_ReadByte(EEPROM_ADR_STATUSH)*256)+(u16)FLASH_ReadByte(EEPROM_ADR_STATUSL);
      status_check = *(u16*)(&status);

      ReadProgram ();
    //When Start Check for Allarm and computing Daily_long_on
     if ( Read_Allarm() == TRUE)
     {
       time_on=daily_hour_on*60+daily_minute_on;
       time_off= daily_hour_off*60+daily_minute_off;
     }

           //Init DS18B20
    DS18Set();
    line_lcd=0;
    if (!Read_DS18())
    {
     printf("\nDS_Err_T");
       hardware.ds18B20=0;
        pressKey();  //while (!key_ok_on());
    }
     else hardware.ds18B20=1;

    //daily_dispaly=' ';
    //month_display=' ';
    sync_time_ds1307= TRUE;

          //Same delay if  power jitter
    if (status.on)
    {
     line_lcd=0;
     printf("\nWait 3s.");
     timer3=0;
     while (timer3<=power_jitter);
    }

     //UART2_Cmd(DISABLE);  // Disable UART for the moment

     // Working fuction
    //Set_DS1307(13,7,13,34,0);//u8 year ,u8 month,u8 hours,u8 minutes,u8 seconds)



    // strcpy(line1,"Hello I am here! ");
    //  while(1)
    //  {
    //     Display_Line(line1);
    //     Delay2(20000);
    //  }
    //  while (!key_ok_on());
       //sprintf(line1,"TIMER ON ");

     /* Main Loop*/

    while(1)
    {


      if(key_ok_on()) FirstMenu();
      if(key_plus_on()) Power_On();
      if(key_minus_on())Power_Off();
      if(Time_Display) Display();  //

      if(sync_time_ds1307 )  // Sync local time with DS1307
         {
          if (!ReadDS1307())
              {
                GPIO_WriteLow(GPIOD, power_pin );
             printf("\n E2:%d",error);
             //restart i2c
             // Reset the CPU: Enable the watchdog and wait until it expires
             IWDG->KR = IWDG_KEY_ENABLE;
             while ( 1 );    // Wait until reset occurs from IWDG
              }
         sync_time_ds1307=FALSE;
         sync_display='S';
         }

      if(status.on) GPIO_WriteHigh(GPIOD, power_pin );
       else   GPIO_WriteLow(GPIOD, power_pin );



    }



}

void Display(void)
{
   //Clear_Line1 ();
    result1=temperature();
     result2=0;
      if(result1%2!=0) result2=5;
       result1/=2;



   if (status.manu) manu_display='M';
     else manu_display='A';
     //Blink D
   if (status.on && !status.manu)
   {
     if (program_display=='P') program_display=' ';
      else program_display='P';
   }

    else if (status.on) program_display='P';
     else program_display=' ';
    if(hardware.ds18B20)sprintf(line1,"\n%d.%dC%c%c%c",result1,result2,sync_display,program_display,manu_display);
      else sprintf(line1,"\n%c%c%c",sync_display,program_display,manu_display);

   line_lcd=0;
   printf(line1);

   line_lcd=1;
   printf("\n%02d:%02d:%02d",hours,minutes,seconds);


   Time_Display=FALSE;
   sync_display=' ';
}

void Power_On()
{
  //status.auto=0;
  status.on=1;
  status.manu=1; //Manu
  SaveStatus();
  //hardware.lcdLed=1;
}

void Power_Off()
{
  status.on=0;
  status.manu=1; //Manu
  SaveStatus();
   //hardware.lcdLed=0;

}

void InitI2C(void)
{
   I2C_DeInit();
   I2C_Init(10000, 0xA2, I2C_DUTYCYCLE_2, I2C_ACK_CURR, I2C_ADDMODE_7BIT, 2);
   I2C_Cmd(ENABLE);
}

bool I2C_Start(void)
{
   I2C_GenerateSTART(ENABLE);
       timeout=100;
    	while(!(I2C_CheckEvent(I2C_EVENT_MASTER_MODE_SELECT))&&timeout);
        if (!timeout)
        {
            error=1;
           return FALSE;
        }
          else return TRUE;
}

bool I2C_WA(u8 address)
{
  I2C_Send7bitAddress(address, I2C_DIRECTION_TX);
       timeout=255;
        while(!(I2C_CheckEvent(I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&&timeout);
         if (!timeout)
         {
          error=2;
           return FALSE ;
         }
          else return TRUE;
}

bool I2C_RA(u8 address)
{
  I2C_Send7bitAddress(address, I2C_DIRECTION_RX);
       timeout=255;
        while(!(I2C_CheckEvent(I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))&&timeout);
         if (!timeout)
         {
           error=3;
           return FALSE ;
         }
          else return TRUE;
}


bool I2C_WD(u8 data)
{
 I2C_SendData(data);   // set register pointer 00h
   timeout=255;
   while(!(I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED))&&timeout);
    if (!timeout)
    {
      error=4;
       return FALSE ;
    }
     else return TRUE;
}

u8 I2C_RD(void)
{
 timeout=255;
  while( !I2C_GetFlagStatus(I2C_FLAG_TRANSFERFINISHED)&& timeout);
 //while((!(I2C->SR1 & 0x40))&&timeout);
 if (!timeout)
 {
   error=5;
   return FALSE;
 }
 u8 data=I2C_ReceiveData();
 return data;
}

  /*
bool Init_DS1307(void)
{
   // Test DS1307
    error=0;
    if (!I2C_Start()) return FALSE;
    if(!I2C_WA(0xD0)) return FALSE;
    if(!I2C_WD(0x00)) return FALSE;
    if(!I2C_WD(0x00)) return FALSE;
    I2C_GenerateSTOP(ENABLE);

    // timeout=100;  error=4;
    ///   while(!(I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED))&&timeout);
    //    if (!timeout)return FALSE ;
     return TRUE;
}
   */

bool  ReadDS1307(void)
{        TIM3_Cmd(DISABLE);
       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0))return FALSE;
       if(!I2C_WD(0x00)) return FALSE;
       I2C_GenerateSTOP(ENABLE);
       if (!I2C_Start()) return FALSE;
       if(!I2C_RA(0xD0))return FALSE;
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       seconds = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       minutes = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       hours = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       days = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       date = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       month = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_NONE);
         I2C_GenerateSTOP(ENABLE);
          year= bcd2hex(I2C_RD());

     //  I2C_AcknowledgeConfig(I2C_ACK_CURR);
     //   u8 data1 = I2C_RD();
      //Last read byte by I2C slave
     //  I2C_AcknowledgeConfig(I2C_ACK_NONE);
     //  I2C_GenerateSTOP(ENABLE);
     //  temp2= I2C_RD();
       if( seconds & 0x80 )    //if not enable the oscillator ?
          {
            seconds &= 0x7f;
            Set_DS1307();
          }
        hardware.ds1307=1;
       TIM3_Cmd(ENABLE);
       return TRUE;
}

bool Check_DS1307(void)
{
   // Read  address 0x08 from DS1307 if not 0XAA clock is not set
       error=0;
       if (!hardware.ds1307) return FALSE;    //If not DS1307
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0)) return FALSE;
       if(!I2C_WD(0x08)) return FALSE;
       I2C_GenerateSTOP(ENABLE);
        //Last read byte by I2C slave
       if (!I2C_Start()) return FALSE;
       if(!I2C_RA(0xD0))return FALSE;
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       u8 data = I2C_RD();
       I2C_AcknowledgeConfig(I2C_ACK_NONE);
       I2C_GenerateSTOP(ENABLE);
       if (data != 0xAA) return FALSE;
       else return TRUE;
}

