claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
}




bool DS18_Write(u8 data)
{
  disableInterrupts();
  for ( u8 i=0;i<8;i++)
  {
   DS18(0);
   Delay_us(1); //Delay1(0); //Start time slot 4,5 us
   if( data & (1<<i)) DS18(1)
     //else DS18(0);
   Delay_us(160);  // 60us end time slot
   DS18(1);
   //Delay1(0);
  }
  enableInterrupts();
  return TRUE;

}


u8  DS18_Read()
{
    //Init DS18b20 data pin as Input

  u8 data=0;
    disableInterrupts();    //01.10.2013
  for (u8 i=0;i<8;i++)
  {
    DS18(0);
    Delay_us(1); //Start time slot 4,5 us
    DS18(1);
    Delay_us(35); // Wait for ds18b20 set bit 15us
    //Delay1(0);
   data +=((1<<i)*(GPIO_ReadInputPin(GPIOD,ds18_data)&&ds18_data));
    Delay_us(120); // Wait 60 us until end of read slot  45us
    //  DS18(1);  // Next bit
   // Delay1(0);

  }
    enableInterrupts();
    //Init DS18b20 data pin
   // GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_OD_HIZ_FAST);
   return data;
}

bool DS18_Reset()
{
   //Init Reset Pulse
    DS18(0);
    Delay1(25);    //25=524us
    DS18(1);
    //Delay1(1);
    timer2=0;
    while ((timer2 < TIMEOUT_DS18B20) && (GPIO_ReadInputPin(GPIOD, ds18_data)));;   //Wait for ack from DS18B20
    if (timer2>=TIMEOUT_DS18B20)
    {
      hardware.ds18B20=0;
      return FALSE;
    }

    timer2=0; // Then Wait for Release bus set to One
     while ((timer2 < TIMEOUT_DS18B20) && (!GPIO_ReadInputPin(GPIOD, ds18_data)));;
      if (timer2>=TIMEOUT_DS18B20)
       {
        hardware.ds18B20=0;
        return FALSE;
       }

    // Delay1(10);
    //Delay1(20);    //25=524us
     hardware.ds18B20=1;
    return TRUE;
}

u8 temperature ()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < TIMEOUT_DS18B20) && !(DS18_Read()));;
      if (timer2>TIMEOUT_DS18B20) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
    DS18_Reset();
      u16 result = temp2*256+temp1;
      temp1= (u8)(result>>3);
     return temp1;
}

bool Read_DS18()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < TIMEOUT_DS18B20) && !(DS18_Read()));;
      if (timer2>TIMEOUT_DS18B20) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
     u8 temp3=DS18_Read();
     u8 temp4=DS18_Read();
     u8 temp5=DS18_Read();
     u8 temp6=DS18_Read();
     u8 temp7=DS18_Read();
     u8 temp8=DS18_Read();
     u8 temp9=DS18_Read();

     DS18_Reset();

      line_lcd=0;
      result2=0;
      u16 result = temp2*256+temp1;
      result1= (u8)(result>>3);
      if(result1%2!=0) result2=5;
      result1 /=2;


      printf("\n%d.%d",result1,result2);
     // printf("\n%02x%02x%02x",temp1,temp2,temp5);
     //line_lcd=1;
     // printf("\n%02x%02x%02x",temp7,temp8,temp9);
     // while (!key_ok_on());

     //u8 temp3=DS18_Read();

    return TRUE;
}

bool DS18Set ()
{
     //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  WRITE SCRATCHPAD 0x4E
    DS18_Write(0x4E);
   //Write 3 bytes last is config reg
    DS18_Write(125);
    DS18_Write(0xDC); //-55
    DS18_Write(0x1F);

   //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    //Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function   Store in Conf Reg
    DS18_Write(0x48);






  return TRUE;
}








void Delay1(u16 Delay)
{
    //1 = 40us,2=60us,3=80us,10=200us, 15=320us,
  timer1=0;
  while ( timer1 < Delay); ;
}

 void Delay2(u16 Delay)
{
  timer2=0;
  while ( timer2 < Delay); ;
}


void Delay_us (u16 time) //1:3.2us,100:39us,200:77us,35:15.2us,120:45us,160:60us
{
  //disableInterrupts();
  do
    {
      time--;
      nop();
    }
    while (time);
  //enableInterrupts();
}


void Display_Line(char* line)
{
  char current_char= *line++;
  u8 count;
    //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
  do
  {

    if (current_char > 0x1b)   //Display only valid data
     {
       LCDData(current_char);
        Delay1(1);
       count++;
     }
     current_char=*line++;
  }  while ((current_char != 0x00) && (count<7));

   Rotate_Line(line1);

}

void Rotate_Line( char * line)
{

   char temp_first = *line;
   char temp_next;

   do
   {
      temp_next=*(line+1);
     *line++=temp_next;
      //line++;
      //temp_next=*line;
     //*line=*line++;
   } while (*line !=0);
   line--;
   *line=temp_first;

}

void Clear_Line1 ()
{
     //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
    u8 count=0;
   do
   {
     LCDData(' ');
        Delay1(1);
        count++;
   }while (count<8);


}

void Clear_Line2 ()
{
     //Set Cursor to Second  Line
   LCDInstr(0x80 | 0x40);
   count=0;
   Delay1(1);
    u8 count=0;
   do
   {
     LCDData(' ');
        Delay1(1);
        count++;
   }while (count<8);


}



void FirstMenu()
{
      // Clear Display
    LCDInstr(0x01); //Clear LCD
    Delay1(250);

      line_lcd=0;
      printf("\nManuAuto");
      line_lcd=1;
       if (!status.manu)
      printf( "\nAuto");
       else  printf("\nManu");

       do
       {
       pressKey();

        if(button==2)      // Plus Button
        {
          if(status.manu) status.manu=0;
           else status.manu=1;
          line_lcd=1;
          if(status.manu)printf("\nManu");
          else  printf("\nAuto");
        }

        if( button==3 || button==0 )      // Minus Button
        {
          SaveStatus();
          return;
        }


       } while( button!=1);

         SaveStatus();
         button=0;
         ProgramMenu();


