claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
}



void ProgramMenu()
{
  return;
}



void Menu (void)
{
 // Clear Display
    LCDInstr(0x01); //Clear LCD
    Delay1(250);
    //u8 key;
 /* First Line 1. Time On 2. Time off 3.Timer ON/OFF 4.Exit
    Wait for Plus,Minius or OK
    If plus next option from Menu on the end EXIT
    If minus previous option from Menu  on the end EXIT
    If OK enter to menu option
    If time out about 10s exit from Menu
 */






    do {

First_Menu:
    line_lcd=0;
    printf("\nON      ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
     pressKey();
    switch (button)
        {
        case 1: goto Second_Menu ;
         break;
        case 2: Set_Timer_On();
         break;
        case 3: goto Exit_Menu;
         break;
        }
        break; //Exit Menu


Second_Menu:
    line_lcd=0;
    printf("\nOFF     ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
      pressKey();
      switch (button)
        {
        case 1: goto Third_Menu ;
         break;
        case 2: Set_Timer_Off();
         break;
        case 3: goto First_Menu;
         break;
        }
     break; //Exit Menu

Third_Menu:
      line_lcd=0;
    printf("\nMonthly ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",monthly_year,monthly_month,monthly_date);
      pressKey();
      switch (button)
        {
        case 1: goto Fourth_Menu;
         break;
        case 2:
          {
           setData();
           monthly_year=y;
           monthly_month=m;
           monthly_date=d;
           status.monthly=1;
           status.daily=0;  // Disable Daily Alarm On date enable it
           status.on=0;     // Power off
           // Save Status and Date in EEPROM
           EEPROM_INIT();
           FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
           FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_YEAR,y);
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_MONTH,m);
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_DATE,d);
           FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
           break;
          }
        case 3: goto Second_Menu ;
         break;
        }
     break; //Exit Menu


Fourth_Menu:
    line_lcd=0;
    printf("\nClock   ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",hours,minutes,seconds);
      pressKey();
      switch (button)
        {
        case 1: goto Fifth_Menu ;
         break;
        case 2: Set_Clock();
         break;
        case 3: goto Third_Menu;
         break;
        }
     break; //Exit Menu


Fifth_Menu:
    line_lcd=0;
    printf("\nDate    ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",year,month,date);
      pressKey();
      switch (button)
        {
        case 1: goto Exit_Menu ;
         break;
        case 2: Set_Clock();
         break;
        case 3: goto Fourth_Menu;
         break;
        }
     break; //Exit Menu


Exit_Menu:
    line_lcd=0;
    printf("\nExit OK ");
    line_lcd=1;
    printf("\n+/-     ");
       pressKey();
      switch (button)
        {
        case 1: goto First_Menu;
         break;
        case 2:
         break;
        case 3: goto Fifth_Menu;
         break;
        }
       break; //Exit Menu
    }    while (1);
    //exit:
   Clear_Line1();
   Clear_Line2();

}


void pressKey(void)
{
   button =0;
   timer3=0;
   hardware.lcdLed=1;
   lcdLedTimer=LCDLEDON;
   do
   {
      if (key_ok_on()) button=1;
         else if (key_plus_on())button=2;
        else if (key_minus_on())button=3;
   } while ( (timer3<=time_menu) && !button);    //(timer3<=time_menu) &&

    if (button==0) beep(10000);

   //return button;
}




bool setData(void)
{
   u8 leap=0 ,date_end,month_start=1,date_start=1;
   int yy;

         //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nYear>");
   y=year;
   m=month;
   d=date;
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
       y=adj(0,99,y);
    } while (!key_ok_on());
        yy=y+2000;
    if ( yy%400==0 ||(yy%100!=0 && yy%4==0)) leap=1;
        y=yy-2000;
         if(y==year) month_start=month;
     line_lcd=0;
    printf("\nMonth>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
      m=adj(month_start,12,m);
    } while (!key_ok_on());

    if ( m == 1 || m==3 || m==5 ||m==7||m==8||m==10||m==12) date_end=31;
     else if ( m==4||m==6 || m==9 ||m==11) date_end=30;
      else
       {
         if(leap) date_end=29;
          else date_end=28;
       }
     if( y==year && m==month) date_start=d;
    LCDInstr(0x01);
     Delay1(1000);
      line_lcd=0;
    printf("\nDate>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
       d=adj(date_start,date_end,d);
    } while (!key_ok_on());

      //Set clock keeper
     //year=y;
     //month=m;
     //date=d;
     //Set_DS1307();

  return TRUE;
}


void initBeep(void)
{
  BEEP_DeInit();
  BEEP_Init(BEEP_FREQUENCY_2KHZ);
   BEEP_Cmd(ENABLE);
     Delay1(10000);
   BEEP_Cmd(DISABLE);

}

void beep(u16 Interval)
{

 BEEP_Cmd(ENABLE);
     Delay1(Interval);
  BEEP_Cmd(DISABLE);

}

 PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
      //USART_SendData(USART3, (u8) ch);
     LCD(ch);
   /* Loop until the end of transmission */
    //while(USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET);;
  return ch;
}

 #ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {

  }
}
#endif

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
